---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.FlatOnTop
source: html/717ef71c-64bf-953a-adad-213004aaf6ca.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.FlatOnTop Property

The abbreviation of the Flat On Top (FOT) string.

## Syntax (C#)
```csharp
public string FlatOnTop { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null